const EquipList = [
  {
    id: '1',
    name: '铁剑',
    dsc: [

    ],
    attr: {
      maxHp       : [100,0,0,0],  // 血量最大值
      maxMp       : [100,0,0,0],  // 魔法最大值
      atk         : [5,0,0,0] ,   // 攻击
      def         : [7,0,0,0] ,   // 防御
      str         : [3,0,0,0] ,   // 力量
      dex         : [2,0,0,0] ,   // 敏捷
      int         : [1,0,0,0] ,   // 智力
      critical    : [10,0,0,0] ,  // 暴击几率    90 => 暴击率90%
      dodge       : [12,0,0,0] ,  // 闪避几率    90 => 闪避率90%
      coolTimePer : [3,0,0,0] ,   // 冷却时间减少 10 => 冷却时间减少10%
      critiDmg    : [6,0,0,0] ,   // 暴击伤害倍数 1.5 => 1.5倍
      dmgDown     : [1,0,0,0] ,   // 伤害减少 [5,10], 免伤 5 + 10%
    },
    skills: ['3', '4'],
    buffs: ['1'],
  },
  {
    id: '2',
    name: '圆盾',
    dsc: [

    ],
    attr: {
      maxHp       : [6666,0,0,0],  // 血量最大值
      maxMp       : [6666,0,0,0],  // 魔法最大值
      atk         : [6666,0,0,0] ,   // 攻击
      def         : [6666,0,0,0] ,   // 防御
      str         : [6666,0,0,0] ,   // 力量
      dex         : [6666,0,0,0] ,   // 敏捷
      int         : [6666,0,0,0] ,   // 智力
      critical    : [6666,0,0,0] ,  // 暴击几率    90 => 暴击率90%
      dodge       : [6666,0,0,0] ,  // 闪避几率    90 => 闪避率90%
      coolTimePer : [6666,0,0,0] ,   // 冷却时间减少 10 => 冷却时间减少10%
      critiDmg    : [6666,0,0,0] ,   // 暴击伤害倍数 1.5 => 1.5倍
      dmgDown     : [6666,0,0,0] ,   // 伤害减少 [5,10], 免伤 5 + 10%
    },
    skills: [],
    buffs: [],
  }
]