const SkillList = [
  {
    name: '普通攻击',
    dsc: `对敌人造成100%的伤害`,
    events: ['1'],
  },
  {
    name: '狂热',
    dsc: `狂怒下,造成伤害增加30%`,
    events: ['2'],
  },
  {
    name: '圣光术',
    dsc: `恢复10%损失的生命值, 增加30%伤害`,
    events: ['2','3'],
  },
  {
    id: '100000',
    name: '剧毒喷雾',
    dsc: `每秒对敌人造成15%毒属性的伤害，如果对方处于狂热状态, 造成的伤害翻倍`,
    events: ['4'],
  },
  {
    id: '100000_1',
    events: ['4_1'],
  },
  {
    id: '100000_2',
    events: ['4_2'],
  },
  {
    id: '100001',
    name: '解毒',
    dsc: `解除 剧毒喷雾 的中毒状态!`,
    events: ['5'],
  },
]
